Sorry, I dont get it: Please tell me exactly what you are doing. I did the same three days ago, without a hassle... 
Today it's not working anymore.. (working with git SHA 4497a7fd7f79bc63dd4ef4efa21ce10dbe987ded...)

-  New project
- new token,
- added my public `id_rsa.pub` and private `id_rsa` ... in 

`terraform.tfvars`

```
# You need to replace these
hcloud_token = "MYTOKENISHERE"
public_key   = "/Users/jan/.ssh/id_rsa.pub"
private_key = "/Users/jan/.ssh/id_rsa"
```

then running:

```
tf init
tf apply
```

```

    ~/Coding/RubymineProjects/metashop/kube-hetzner    custom_firewall_rules !1 ?1 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
❯ tf apply --auto-approve
random_password.k3s_token: Refreshing state... [id=none]
hcloud_ssh_key.k3s: Refreshing state... [id=5546260]
local_file.traefik_config: Refreshing state... [id=25ba84696ee16d68f5b98f6ea6b70bb14c3c530c]
hcloud_placement_group.k3s: Refreshing state... [id=21327]
hcloud_network.k3s: Refreshing state... [id=1366303]
hcloud_firewall.k3s: Refreshing state... [id=299258]
hcloud_network_subnet.k3s: Refreshing state... [id=1366303-10.0.0.0/16]
local_file.kured_config: Refreshing state... [id=40fc9944ff7c7fd7faa108c8ffaa8c13042b0ebf]
local_file.hetzner_ccm_config: Refreshing state... [id=f5ec6cb5689cb5830d04857365d567edae562174]
local_file.hetzner_csi_config: Refreshing state... [id=aa232912bcf86722e32b698e1e077522c7f02a9d]
hcloud_server.first_control_plane: Refreshing state... [id=17907745]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # hcloud_network.k3s has been changed
  ~ resource "hcloud_network" "k3s" {
        id                = "1366303"
      + labels            = {}
        name              = "k3s"
        # (2 unchanged attributes hidden)
    }
  # hcloud_ssh_key.k3s has been changed
  ~ resource "hcloud_ssh_key" "k3s" {
        id          = "5546260"
      + labels      = {}
        name        = "k3s"
        # (2 unchanged attributes hidden)
    }
  # hcloud_firewall.k3s has been changed
  ~ resource "hcloud_firewall" "k3s" {
        id     = "299258"
        name   = "k3s"
        # (1 unchanged attribute hidden)

      + apply_to {
          + server = 17907745
        }

        # (13 unchanged blocks hidden)
    }
  # hcloud_placement_group.k3s has been changed
  ~ resource "hcloud_placement_group" "k3s" {
        id      = "21327"
        name    = "k3s"
      ~ servers = [
          + 17907745,
        ]
        # (2 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.agents[0] will be created
  + resource "hcloud_server" "agents" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = [
          + 299258,
        ]
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + location           = "fsn1"
      + name               = "k3s-agent-0"
      + placement_group_id = 21327
      + rebuild_protection = false
      + rescue             = "linux64"
      + server_type        = "cpx21"
      + ssh_keys           = [
          + "5546260",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.1.1"
          + mac_address = (known after apply)
          + network_id  = 1366303
        }
    }

  # hcloud_server.agents[1] will be created
  + resource "hcloud_server" "agents" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = [
          + 299258,
        ]
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + location           = "fsn1"
      + name               = "k3s-agent-1"
      + placement_group_id = 21327
      + rebuild_protection = false
      + rescue             = "linux64"
      + server_type        = "cpx21"
      + ssh_keys           = [
          + "5546260",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.1.2"
          + mac_address = (known after apply)
          + network_id  = 1366303
        }
    }

  # hcloud_server.control_planes[0] will be created
  + resource "hcloud_server" "control_planes" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = [
          + 299258,
        ]
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + location           = "fsn1"
      + name               = "k3s-control-plane-1"
      + placement_group_id = 21327
      + rebuild_protection = false
      + rescue             = "linux64"
      + server_type        = "cpx11"
      + ssh_keys           = [
          + "5546260",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.3"
          + mac_address = (known after apply)
          + network_id  = 1366303
        }
    }

  # hcloud_server.control_planes[1] will be created
  + resource "hcloud_server" "control_planes" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = [
          + 299258,
        ]
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + location           = "fsn1"
      + name               = "k3s-control-plane-2"
      + placement_group_id = 21327
      + rebuild_protection = false
      + rescue             = "linux64"
      + server_type        = "cpx11"
      + ssh_keys           = [
          + "5546260",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.4"
          + mac_address = (known after apply)
          + network_id  = 1366303
        }
    }

  # hcloud_server.first_control_plane is tainted, so must be replaced
-/+ resource "hcloud_server" "first_control_plane" {
      + backup_window      = (known after apply)
      ~ datacenter         = "fsn1-dc14" -> (known after apply)
      ~ id                 = "17907745" -> (known after apply)
      ~ ipv4_address       = "49.12.11.173" -> (known after apply)
      ~ ipv6_address       = "2a01:4f8:c17:413d::1" -> (known after apply)
      ~ ipv6_network       = "2a01:4f8:c17:413d::/64" -> (known after apply)
        name               = "k3s-control-plane-0"
      ~ status             = "running" -> (known after apply)
        # (12 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.0.2" -> null
          - mac_address = "86:00:00:03:ca:f8" -> null
          - network_id  = 1366303 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = "10.0.0.2"
          + mac_address = (known after apply)
          + network_id  = 1366303
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + agents_public_ip        = [
      + (known after apply),
      + (known after apply),
    ]
  + controlplanes_public_ip = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
hcloud_server.first_control_plane: Destroying... [id=17907745]
hcloud_server.first_control_plane: Destruction complete after 1s
hcloud_server.first_control_plane: Creating...
hcloud_server.first_control_plane: Still creating... [10s elapsed]
hcloud_server.first_control_plane: Provisioning with 'file'...
hcloud_server.first_control_plane: Still creating... [20s elapsed]
hcloud_server.first_control_plane: Still creating... [30s elapsed]
hcloud_server.first_control_plane: Provisioning with 'remote-exec'...
hcloud_server.first_control_plane (remote-exec): Connecting to remote host via SSH...
hcloud_server.first_control_plane (remote-exec):   Host: 23.88.37.116
hcloud_server.first_control_plane (remote-exec):   User: root
hcloud_server.first_control_plane (remote-exec):   Password: false
hcloud_server.first_control_plane (remote-exec):   Private key: true
hcloud_server.first_control_plane (remote-exec):   Certificate: false
hcloud_server.first_control_plane (remote-exec):   SSH Agent: true
hcloud_server.first_control_plane (remote-exec):   Checking Host Key: false
hcloud_server.first_control_plane (remote-exec):   Target Platform: unix
hcloud_server.first_control_plane (remote-exec): Connected!
hcloud_server.first_control_plane (remote-exec): + apt-get install -y aria2
hcloud_server.first_control_plane (remote-exec): Reading package lists... 0%
hcloud_server.first_control_plane: Still creating... [40s elapsed]
hcloud_server.first_control_plane (remote-exec): Reading package lists... 0%
hcloud_server.first_control_plane (remote-exec): Reading package lists... 16%
hcloud_server.first_control_plane (remote-exec): Reading package lists... Done
hcloud_server.first_control_plane (remote-exec): Building dependency tree... 0%
hcloud_server.first_control_plane (remote-exec): Building dependency tree... 0%
hcloud_server.first_control_plane (remote-exec): Building dependency tree... 50%
hcloud_server.first_control_plane (remote-exec): Building dependency tree... 50%
hcloud_server.first_control_plane (remote-exec): Building dependency tree... Done
hcloud_server.first_control_plane (remote-exec): Reading state information... 0%
hcloud_server.first_control_plane (remote-exec): Reading state information... 0%
hcloud_server.first_control_plane (remote-exec): Reading state information... Done
hcloud_server.first_control_plane (remote-exec): The following additional packages will be installed:
hcloud_server.first_control_plane (remote-exec):   libaria2-0 libc-ares2
hcloud_server.first_control_plane (remote-exec): The following NEW packages will be installed:
hcloud_server.first_control_plane (remote-exec):   aria2 libaria2-0 libc-ares2
hcloud_server.first_control_plane (remote-exec): 0 upgraded, 3 newly installed, 0 to remove and 0 not upgraded.
hcloud_server.first_control_plane (remote-exec): Need to get 1,571 kB of archives.
hcloud_server.first_control_plane (remote-exec): After this operation, 6,225 kB of additional disk space will be used.
hcloud_server.first_control_plane (remote-exec): 0% [Working]
hcloud_server.first_control_plane (remote-exec): Get:1 http://mirror.hetzner.com/debian/packages bullseye/main amd64 libc-ares2 amd64 1.17.1-1+deb11u1 [102 kB]
hcloud_server.first_control_plane (remote-exec): 0% [1 libc-ares2 8,192 B/102 kB 8%]
hcloud_server.first_control_plane (remote-exec): 12% [Working]
hcloud_server.first_control_plane (remote-exec): Get:2 http://mirror.hetzner.com/debian/packages bullseye/main amd64 libaria2-0 amd64 1.35.0-3 [1,107 kB]
hcloud_server.first_control_plane (remote-exec): 13% [2 libaria2-0 16.4 kB/1,107 kB 1%]
hcloud_server.first_control_plane (remote-exec): 75% [Waiting for headers]
hcloud_server.first_control_plane (remote-exec): Get:3 http://mirror.hetzner.com/debian/packages bullseye/main amd64 aria2 amd64 1.35.0-3 [362 kB]
hcloud_server.first_control_plane (remote-exec): 79% [3 aria2 77.7 kB/362 kB 21%]
hcloud_server.first_control_plane (remote-exec): 100% [Working]
hcloud_server.first_control_plane (remote-exec): Fetched 1,571 kB in 0s (5,010 kB/s)
hcloud_server.first_control_plane (remote-exec): Selecting previously unselected package libc-ares2:amd64.
hcloud_server.first_control_plane (remote-exec): (Reading database ...
hcloud_server.first_control_plane (remote-exec): (Reading database ... 5%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 10%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 15%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 20%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 25%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 30%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 35%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 40%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 45%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 50%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 55%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 60%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 65%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 70%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 75%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 80%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 85%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 90%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 95%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 100%
hcloud_server.first_control_plane (remote-exec): (Reading database ... 62163 files and directories currently installed.)
hcloud_server.first_control_plane (remote-exec): Preparing to unpack .../libc-ares2_1.17.1-1+deb11u1_amd64.deb ...
hcloud_server.first_control_plane (remote-exec): Unpacking libc-ares2:amd64 (1.17.1-1+deb11u1) ...
hcloud_server.first_control_plane (remote-exec): Selecting previously unselected package libaria2-0:amd64.
hcloud_server.first_control_plane (remote-exec): Preparing to unpack .../libaria2-0_1.35.0-3_amd64.deb ...
hcloud_server.first_control_plane (remote-exec): Unpacking libaria2-0:amd64 (1.35.0-3) ...
hcloud_server.first_control_plane (remote-exec): Selecting previously unselected package aria2.
hcloud_server.first_control_plane (remote-exec): Preparing to unpack .../aria2_1.35.0-3_amd64.deb ...
hcloud_server.first_control_plane (remote-exec): Unpacking aria2 (1.35.0-3) ...
hcloud_server.first_control_plane (remote-exec): Setting up libc-ares2:amd64 (1.17.1-1+deb11u1) ...
hcloud_server.first_control_plane (remote-exec): Setting up libaria2-0:amd64 (1.35.0-3) ...
hcloud_server.first_control_plane (remote-exec): Setting up aria2 (1.35.0-3) ...
hcloud_server.first_control_plane (remote-exec): Processing triggers for man-db (2.9.4-2) ...
hcloud_server.first_control_plane (remote-exec): Processing triggers for libc-bin (2.31-13+deb11u2) ...
hcloud_server.first_control_plane (remote-exec): + aria2c --follow-metalink=mem https://raw.githubusercontent.com/kube-hetzner/kube-hetzner/master/.files/openSUSE-MicroOS.x86_64-k3s-kvm-and-xen.qcow2.meta4

hcloud_server.first_control_plane (remote-exec): 02/11 16:03:23 [NOTICE] Downloading 1 item(s)
hcloud_server.first_control_plane (remote-exec): [#eb520d 0B/0B CN:1 DL:0B]

hcloud_server.first_control_plane (remote-exec): 02/11 16:03:24 [NOTICE] Download complete: [MEMORY]openSUSE-MicroOS.x86_64-k3s-kvm-and-xen.qcow2.meta4
hcloud_server.first_control_plane (remote-exec): [#a37143 37MiB/600MiB(6%) CN:5 DL:59MiB
hcloud_server.first_control_plane (remote-exec): [#a37143 227MiB/600MiB(37%) CN:5 DL:140
hcloud_server.first_control_plane (remote-exec): [#a37143 473MiB/600MiB(78%) CN:5 DL:181
hcloud_server.first_control_plane (remote-exec): [#a37143 583MiB/600MiB(97%) CN:2 DL:162
hcloud_server.first_control_plane: Still creating... [50s elapsed]
hcloud_server.first_control_plane (remote-exec): [#a37143 589MiB/600MiB(98%) CN:1 DL:127
hcloud_server.first_control_plane (remote-exec): 02/11 16:03:29 [NOTICE] Download complete: /root/openSUSE-MicroOS.x86_64-16.0.0-k3s-kvm-and-xen-Snapshot20220207.qcow2

hcloud_server.first_control_plane (remote-exec): Download Results:
hcloud_server.first_control_plane (remote-exec): gid   |stat|avg speed  |path/URI
hcloud_server.first_control_plane (remote-exec): ======+====+===========+=======================================================
hcloud_server.first_control_plane (remote-exec): eb520d|OK  |    13MiB/s|[MEMORY]openSUSE-MicroOS.x86_64-k3s-kvm-and-xen.qcow2.meta4
hcloud_server.first_control_plane (remote-exec): a37143|OK  |   124MiB/s|/root/openSUSE-MicroOS.x86_64-16.0.0-k3s-kvm-and-xen-Snapshot20220207.qcow2

hcloud_server.first_control_plane (remote-exec): Status Legend:
hcloud_server.first_control_plane (remote-exec): (OK):download completed.
hcloud_server.first_control_plane (remote-exec): + ls+  -agrep -ie ^opensuse.*microos.*k3s.*qcow2$

hcloud_server.first_control_plane (remote-exec): + qemu-img convert -p -f qcow2 -O host_device openSUSE-MicroOS.x86_64-16.0.0-k3s-kvm-and-xen-Snapshot20220207.qcow2 /dev/sda
hcloud_server.first_control_plane (remote-exec):     (0.00/100%)
hcloud_server.first_control_plane (remote-exec):     (1.00/100%)
hcloud_server.first_control_plane (remote-exec):     (2.01/100%)
hcloud_server.first_control_plane (remote-exec):     (3.01/100%)
hcloud_server.first_control_plane (remote-exec):     (4.01/100%)
hcloud_server.first_control_plane (remote-exec):     (5.02/100%)
hcloud_server.first_control_plane (remote-exec):     (6.02/100%)
hcloud_server.first_control_plane (remote-exec):     (7.03/100%)
hcloud_server.first_control_plane (remote-exec):     (8.04/100%)
hcloud_server.first_control_plane (remote-exec):     (9.05/100%)
hcloud_server.first_control_plane (remote-exec):     (10.05/100%)
hcloud_server.first_control_plane (remote-exec):     (11.05/100%)
hcloud_server.first_control_plane (remote-exec):     (12.06/100%)
hcloud_server.first_control_plane (remote-exec):     (13.06/100%)
hcloud_server.first_control_plane (remote-exec):     (14.06/100%)
hcloud_server.first_control_plane (remote-exec):     (15.07/100%)
hcloud_server.first_control_plane (remote-exec):     (16.07/100%)
hcloud_server.first_control_plane (remote-exec):     (17.07/100%)
hcloud_server.first_control_plane (remote-exec):     (18.08/100%)
hcloud_server.first_control_plane (remote-exec):     (19.08/100%)
hcloud_server.first_control_plane (remote-exec):     (20.09/100%)
hcloud_server.first_control_plane (remote-exec):     (21.09/100%)
hcloud_server.first_control_plane (remote-exec):     (22.09/100%)
hcloud_server.first_control_plane (remote-exec):     (23.10/100%)
hcloud_server.first_control_plane (remote-exec):     (24.10/100%)
hcloud_server.first_control_plane (remote-exec):     (25.10/100%)
hcloud_server.first_control_plane (remote-exec):     (26.11/100%)
hcloud_server.first_control_plane (remote-exec):     (27.11/100%)
hcloud_server.first_control_plane (remote-exec):     (28.11/100%)
hcloud_server.first_control_plane (remote-exec):     (29.12/100%)
hcloud_server.first_control_plane (remote-exec):     (30.12/100%)
hcloud_server.first_control_plane (remote-exec):     (31.12/100%)
hcloud_server.first_control_plane (remote-exec):     (32.13/100%)
hcloud_server.first_control_plane (remote-exec):     (33.13/100%)
hcloud_server.first_control_plane (remote-exec):     (34.13/100%)
hcloud_server.first_control_plane (remote-exec):     (35.14/100%)
hcloud_server.first_control_plane (remote-exec):     (36.14/100%)
hcloud_server.first_control_plane (remote-exec):     (37.15/100%)
hcloud_server.first_control_plane (remote-exec):     (38.15/100%)
hcloud_server.first_control_plane (remote-exec):     (39.15/100%)
hcloud_server.first_control_plane (remote-exec):     (40.16/100%)
hcloud_server.first_control_plane (remote-exec):     (41.16/100%)
hcloud_server.first_control_plane (remote-exec):     (42.16/100%)
hcloud_server.first_control_plane (remote-exec):     (43.17/100%)
hcloud_server.first_control_plane (remote-exec):     (44.17/100%)
hcloud_server.first_control_plane (remote-exec):     (45.17/100%)
hcloud_server.first_control_plane (remote-exec):     (46.18/100%)
hcloud_server.first_control_plane (remote-exec):     (47.18/100%)
hcloud_server.first_control_plane (remote-exec):     (48.18/100%)
hcloud_server.first_control_plane (remote-exec):     (49.19/100%)
hcloud_server.first_control_plane (remote-exec):     (50.19/100%)
hcloud_server.first_control_plane (remote-exec):     (51.20/100%)
hcloud_server.first_control_plane (remote-exec):     (52.20/100%)
hcloud_server.first_control_plane (remote-exec):     (53.20/100%)
hcloud_server.first_control_plane (remote-exec):     (54.21/100%)
hcloud_server.first_control_plane (remote-exec):     (55.21/100%)
hcloud_server.first_control_plane (remote-exec):     (56.21/100%)
hcloud_server.first_control_plane (remote-exec):     (57.22/100%)
hcloud_server.first_control_plane (remote-exec):     (58.22/100%)
hcloud_server.first_control_plane (remote-exec):     (59.27/100%)
hcloud_server.first_control_plane (remote-exec):     (60.27/100%)
hcloud_server.first_control_plane (remote-exec):     (61.28/100%)
hcloud_server.first_control_plane (remote-exec):     (62.28/100%)
hcloud_server.first_control_plane (remote-exec):     (63.29/100%)
hcloud_server.first_control_plane (remote-exec):     (64.29/100%)
hcloud_server.first_control_plane (remote-exec):     (65.30/100%)
hcloud_server.first_control_plane (remote-exec):     (66.30/100%)
hcloud_server.first_control_plane (remote-exec):     (67.31/100%)
hcloud_server.first_control_plane (remote-exec):     (68.31/100%)
hcloud_server.first_control_plane (remote-exec):     (69.32/100%)
hcloud_server.first_control_plane (remote-exec):     (70.32/100%)
hcloud_server.first_control_plane (remote-exec):     (71.33/100%)
hcloud_server.first_control_plane (remote-exec):     (72.33/100%)
hcloud_server.first_control_plane (remote-exec):     (73.33/100%)
hcloud_server.first_control_plane (remote-exec):     (74.34/100%)
hcloud_server.first_control_plane (remote-exec):     (75.34/100%)
hcloud_server.first_control_plane (remote-exec):     (76.35/100%)
hcloud_server.first_control_plane (remote-exec):     (77.35/100%)
hcloud_server.first_control_plane (remote-exec):     (78.35/100%)
hcloud_server.first_control_plane (remote-exec):     (79.36/100%)
hcloud_server.first_control_plane (remote-exec):     (80.36/100%)
hcloud_server.first_control_plane (remote-exec):     (81.37/100%)
hcloud_server.first_control_plane (remote-exec):     (82.37/100%)
hcloud_server.first_control_plane (remote-exec):     (83.38/100%)
hcloud_server.first_control_plane (remote-exec):     (84.38/100%)
hcloud_server.first_control_plane (remote-exec):     (85.38/100%)
hcloud_server.first_control_plane (remote-exec):     (86.39/100%)
hcloud_server.first_control_plane (remote-exec):     (87.39/100%)
hcloud_server.first_control_plane (remote-exec):     (88.39/100%)
hcloud_server.first_control_plane (remote-exec):     (89.40/100%)
hcloud_server.first_control_plane (remote-exec):     (90.40/100%)
hcloud_server.first_control_plane (remote-exec):     (91.40/100%)
hcloud_server.first_control_plane (remote-exec):     (92.41/100%)
hcloud_server.first_control_plane (remote-exec):     (93.41/100%)
hcloud_server.first_control_plane (remote-exec):     (94.41/100%)
hcloud_server.first_control_plane (remote-exec):     (95.42/100%)
hcloud_server.first_control_plane (remote-exec):     (96.42/100%)
hcloud_server.first_control_plane (remote-exec):     (97.42/100%)
hcloud_server.first_control_plane: Still creating... [1m0s elapsed]
hcloud_server.first_control_plane (remote-exec):     (98.43/100%)
hcloud_server.first_control_plane (remote-exec):     (99.43/100%)
hcloud_server.first_control_plane (remote-exec):     (100.00/100%)
hcloud_server.first_control_plane (remote-exec):     (100.00/100%)
hcloud_server.first_control_plane (remote-exec): + sgdisk -e /dev/sda
hcloud_server.first_control_plane (remote-exec): The operation has completed successfully.
hcloud_server.first_control_plane (remote-exec): + parted -s /dev/sda resizepart 4 99%
hcloud_server.first_control_plane (remote-exec): + parted -s /dev/sda mkpart primary ext2 99% 100%
hcloud_server.first_control_plane (remote-exec): + partprobe /dev/sda
hcloud_server.first_control_plane (remote-exec): + udevadm settle
hcloud_server.first_control_plane (remote-exec): + fdisk -l /dev/sda
hcloud_server.first_control_plane (remote-exec): Disk /dev/sda: 38.15 GiB, 40961572864 bytes, 80003072 sectors
hcloud_server.first_control_plane (remote-exec): Disk model: QEMU HARDDISK
hcloud_server.first_control_plane (remote-exec): Units: sectors of 1 * 512 = 512 bytes
hcloud_server.first_control_plane (remote-exec): Sector size (logical/physical): 512 bytes / 512 bytes
hcloud_server.first_control_plane (remote-exec): I/O size (minimum/optimal): 512 bytes / 512 bytes
hcloud_server.first_control_plane (remote-exec): Disklabel type: gpt
hcloud_server.first_control_plane (remote-exec): Disk identifier: E5179698-B417-4D07-BD17-C6AF2B022D8B

hcloud_server.first_control_plane (remote-exec): Device        Start      End  Sectors  Size Type
hcloud_server.first_control_plane (remote-exec): /dev/sda1      2048     6143     4096    2M BIOS
hcloud_server.first_control_plane (remote-exec): /dev/sda2      6144    47103    40960   20M EFI
hcloud_server.first_control_plane (remote-exec): /dev/sda3     47104 31438847 31391744   15G Linu
hcloud_server.first_control_plane (remote-exec): /dev/sda4  31438848 79203041 47764194 22.8G Linu
hcloud_server.first_control_plane (remote-exec): /dev/sda5  79204352 80001023   796672  389M Linu
hcloud_server.first_control_plane (remote-exec): + mount /dev/sda4 /mnt/
hcloud_server.first_control_plane (remote-exec): + btrfs filesystem resize max /mnt
hcloud_server.first_control_plane (remote-exec): Resize '/mnt' of 'max'
hcloud_server.first_control_plane (remote-exec): + umount /mnt
hcloud_server.first_control_plane (remote-exec): + mke2fs -L ignition /dev/sda5
hcloud_server.first_control_plane (remote-exec): mke2fs 1.46.2 (28-Feb-2021)
hcloud_server.first_control_plane (remote-exec): Discarding device blocks: done
hcloud_server.first_control_plane (remote-exec): Creating filesystem with 398336 1k blocks and 99960 inodes
hcloud_server.first_control_plane (remote-exec): Filesystem UUID: 33642c40-e2ed-437f-bd1d-22e2c8fc509e
hcloud_server.first_control_plane (remote-exec): Superblock backups stored on blocks:
hcloud_server.first_control_plane (remote-exec): 	8193, 24577, 40961, 57345, 73729, 204801, 221185

hcloud_server.first_control_plane (remote-exec): Allocating group tables: done
hcloud_server.first_control_plane (remote-exec): Writing inode tables: done
hcloud_server.first_control_plane (remote-exec): Writing superblocks and filesystem accounting information: done

hcloud_server.first_control_plane (remote-exec): + mount /dev/sda5 /mnt
hcloud_server.first_control_plane (remote-exec): + mkdir /mnt/ignition
hcloud_server.first_control_plane (remote-exec): + cp /root/config.ign /mnt/ignition/config.ign
hcloud_server.first_control_plane (remote-exec): + umount /mnt
hcloud_server.first_control_plane: Provisioning with 'local-exec'...
hcloud_server.first_control_plane (local-exec): Executing: ["/bin/sh" "-c" "ssh -o UserKnownHostsFile=/dev/null -o StrictHostKeyChecking=no -i /Users/jan/.ssh/id_rsa root@23.88.37.116 '(sleep 2; reboot)&'; sleep 3"]
hcloud_server.first_control_plane (local-exec): Warning: Permanently added '23.88.37.116' (ECDSA) to the list of known hosts.
hcloud_server.first_control_plane (local-exec): Connection to 23.88.37.116 closed by remote host.
hcloud_server.first_control_plane: Still creating... [1m10s elapsed]
hcloud_server.first_control_plane: Provisioning with 'local-exec'...
hcloud_server.first_control_plane (local-exec): Executing: ["/bin/sh" "-c" "until ssh -o UserKnownHostsFile=/dev/null -o StrictHostKeyChecking=no -i /Users/jan/.ssh/id_rsa -o ConnectTimeout=2 root@23.88.37.116 true 2> /dev/null\ndo\n  echo \"Waiting for MicroOS to reboot and become available...\"\n  sleep 2\ndone\n"]
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane: Still creating... [1m20s elapsed]
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane: Still creating... [1m30s elapsed]
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane: Still creating... [1m40s elapsed]
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane: Still creating... [1m50s elapsed]
hcloud_server.first_control_plane (local-exec): Waiting for MicroOS to reboot and become available...
hcloud_server.first_control_plane: Provisioning with 'file'...
hcloud_server.first_control_plane: Still creating... [2m0s elapsed]
hcloud_server.first_control_plane: Still creating... [2m10s elapsed]
hcloud_server.first_control_plane: Still creating... [2m20s elapsed]
hcloud_server.first_control_plane: Still creating... [2m30s elapsed]
hcloud_server.first_control_plane: Still creating... [2m40s elapsed]
hcloud_server.first_control_plane: Still creating... [2m50s elapsed]
hcloud_server.first_control_plane: Still creating... [3m0s elapsed]
hcloud_server.first_control_plane: Still creating... [3m10s elapsed]
hcloud_server.first_control_plane: Still creating... [3m20s elapsed]
hcloud_server.first_control_plane: Still creating... [3m30s elapsed]
hcloud_server.first_control_plane: Still creating... [3m40s elapsed]
hcloud_server.first_control_plane: Still creating... [3m50s elapsed]
hcloud_server.first_control_plane: Still creating... [4m0s elapsed]
hcloud_server.first_control_plane: Still creating... [4m10s elapsed]
hcloud_server.first_control_plane: Still creating... [4m20s elapsed]
hcloud_server.first_control_plane: Still creating... [4m30s elapsed]
hcloud_server.first_control_plane: Still creating... [4m40s elapsed]
hcloud_server.first_control_plane: Still creating... [4m50s elapsed]
hcloud_server.first_control_plane: Still creating... [5m0s elapsed]
hcloud_server.first_control_plane: Still creating... [5m10s elapsed]
hcloud_server.first_control_plane: Still creating... [5m20s elapsed]
hcloud_server.first_control_plane: Still creating... [5m30s elapsed]
hcloud_server.first_control_plane: Still creating... [5m40s elapsed]
hcloud_server.first_control_plane: Still creating... [5m50s elapsed]
hcloud_server.first_control_plane: Still creating... [6m0s elapsed]
hcloud_server.first_control_plane: Still creating... [6m10s elapsed]
hcloud_server.first_control_plane: Still creating... [6m20s elapsed]
hcloud_server.first_control_plane: Still creating... [6m30s elapsed]
hcloud_server.first_control_plane: Still creating... [6m40s elapsed]
hcloud_server.first_control_plane: Still creating... [6m50s elapsed]
╷
│ Error: file provisioner error
│
│   with hcloud_server.first_control_plane,
│   on master.tf line 61, in resource "hcloud_server" "first_control_plane":
│   61:   provisioner "file" {
│
│ timeout - last error: dial tcp 23.88.37.116:22: connect: operation timed out
╵
```

